<template>
    <div className="reviews">
        <h2 className="section_title">
            Отзывы покупателей
        </h2>
        <div className="reviews__cards">
            <ReviewCard v-for="review in reviews" :key="review.id" :review="review"/>
        </div>
    </div>
</template>

<script setup>
import ReviewCard from './ReviewCard.vue'

const reviews = [{
    id: 0,
    user: {
        name: 'Анна',
        photo: '',
        text: 'Я очень рада поделиться своим положительным опытом покупки в вашем цветочном магазине. Каждый раз, когда я заходила в ваш магазин, меня встречали улыбки и дружелюбное обслуживание. Ваш персонал всегда готов помочь и предложить лучший выбор цветов для любого случая'
        }
    },
    {
    id: 1,
    user: {
        name:'Мария',
        photo: '',
        text: 'Я с уверенностью могу рекомендовать ваш цветочный магазин всем своим друзьям и знакомым. Вы – надежный и ответственный партнер, который делает все возможное, чтобы удовлетворить потребности своих клиентов. Спасибо вам за ваше прекрасное обслуживание и качественные цветы. Я обязательно вернусь к вам снова!'
        }
    },
    {
    id: 2,
    user: {
        name: 'Мария',
        photo: '',
        text: 'Я с уверенностью могу рекомендовать ваш цветочный магазин всем своим друзьям и знакомым. Вы – надежный и ответственный партнер, который делает все возможное, чтобы удовлетворить потребности своих клиентов. Спасибо вам за ваше прекрасное обслуживание и качественные цветы. Я обязательно вернусь к вам снова!'
        }
    },
    {
    id: 3
    }]
</script>

<style lang="scss" scoped>
.reviews {
    padding: 5rem 5rem;

    &__cards {
        display: flex;
        flex-wrap: wrap;
        justify-content: space-between;
    }
}
</style>